---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarIncludeFirstBar
source: html/d4e7044c-8b17-8c61-37a5-2006e2529ef5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarIncludeFirstBar Property

"Include First Bar"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarIncludeFirstBar { get; }
```